//--------------------------------------------------------------------------------
//
//　animator.cpp
//	Author : Xu Wenjie
//	Date   : 2017-09-15
//--------------------------------------------------------------------------------
//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "animator.h"
#include "node.h"

//--------------------------------------------------------------------------------
//  UpdateBones
//--------------------------------------------------------------------------------
void CAnimator::UpdateBones(const Frame& current)
{
	for (int count = 0; count < Clusters.size(); ++count)
	{
		Clusters[count].Node->Local = current.BoneFrames[count].Matrix;
	}
}

//--------------------------------------------------------------------------------
//  UpdateClusterWorld
//--------------------------------------------------------------------------------
void CAnimator::UpdateClusterWorld(void)
{
	for (auto& cluster : Clusters)
	{
		cluster.World = cluster.BindPoseInverse * cluster.Node->World;
	}
}