//--------------------------------------------------------------------------------
//	モデルアナライザー用カメラクラス
//　modelAnalyzerCamera.h
//	Author : Xu Wenjie
//	Date   : 2016-06-20
//--------------------------------------------------------------------------------
#pragma once

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "camera.h"

//--------------------------------------------------------------------------------
//  クラス
//--------------------------------------------------------------------------------
class CModelAnalyzerCamera : public CCamera
{
public:
	//--------------------------------------------------------------------------------
	//  関数定義
	//--------------------------------------------------------------------------------
	CModelAnalyzerCamera();
	~CModelAnalyzerCamera() {}

	void Init(void) override;
	void Update(void) override;

private:
	//--------------------------------------------------------------------------------
	//  定数定義
	//--------------------------------------------------------------------------------
	static const float		sc_fRotSpeed;		//カメラ回転速度
	static const float		sc_fStartRotMin;	//カメラ回転開始のスティック最小値
	static const float		sc_fZoomSpeed;		//ズーム速度
	static const float		sc_fDistanceMin;	//注視点と注目点の最小距離
	static const float		sc_fDistanceMax;	//注視点と注目点の最大距離	
};